Assignment2/convertCelsiusToFahrenheit-request.xml

<?xml version="1.0"?>

<soap:Envelope
xmlns:soap="http://www.w3.org/2003/05/soap-envelope/"
soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding">

<soap:Body xmlns:m="http://www.example.org/converter">
  <m:convertCelsiusToFarenheit>
    <m:Celsius>25.6</m:Celsius>
  </m:convertCelsiusToFarenheit>
</soap:Body>

</soap:Envelope>
